<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"9fc4de0369d12eee02e29618fcfd20f4fdb4c661f1a90dbb4c4231def3be83a0","plan_job_ref":"Job Plan Airflow DAGs #363 at https://github.com/cal-itp/data-infra/actions/runs/16430288791","plan_out_hash":"8bd2765eded511509fd95b7b6a79e86983a20e8e71767bce31a4af232b9a965f","plan_hash":"6e2e8016fac672a24bd6464d7818fc160f067937ecd6770f37a3ac6f3561492c","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 1 to add, 3 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer["dags/dbt_all_dag.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "uJ8Z3Q==" -> (known after apply)
!~      detect_md5hash      = "mDS0QrnOpntb04R+HA9/pA==" -> "different hash"
!~      generation          = 1752703531837303 -> (known after apply)
        id                  = "calitp-composer-dags/dbt_all_dag.py"
!~      md5hash             = "mDS0QrnOpntb04R+HA9/pA==" -> (known after apply)
        name                = "dags/dbt_all_dag.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["dags/dbt_manual_dag.py"] will be created
+   resource "google_storage_bucket_object" "calitp-composer" {
+       bucket         = "calitp-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/dbt_manual_dag.py"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../airflow/dags/dbt_manual_dag.py"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "M+f8vQ==" -> (known after apply)
!~      detect_md5hash      = "81XIkJU4XwP7csEy+4bnnQ==" -> "different hash"
!~      generation          = 1752855617049915 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "81XIkJU4XwP7csEy+4bnnQ==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "YfZfjQ==" -> (known after apply)
!~      detect_md5hash      = "5p3Xx3jg7PEv/8nnsOaVEQ==" -> "different hash"
!~      generation          = 1752855618368363 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "5p3Xx3jg7PEv/8nnsOaVEQ==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 1 to add, 3 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Airflow DAGs #363](https://github.com/cal-itp/data-infra/actions/runs/16430288791)